let handler = async (m, { conn }) => {
    conn.reply(m.chat, `✨———————✨\n\n💬「 ${pickRandom(global.verdaad)} 」💬\n\n╰━━━━━━━━━━━━━━━━╯
❖ 𓆩 ⫷✧ ᴍɪᴋᴇʏ ʙᴏᴛ ✧⫸ 𓆪 ❖


`, m)
}
handler.help = ['تاج']
handler.tags = ['fun']
handler.command = /^تاج/i
export default handler

function pickRandom(list) {
    return list[Math.floor(list.length * Math.random())]
}

global.verdaad = [
    "🎯 أول منشن ذكي",
    "🔥 أول منشن عمك", 
    "💖 أول منشن يحبك", 
    "🐴 ثاني منشن حمار", 
    "👀 ثالث منشن يحب كانيكي أكثر منك", 
    "🎌 خامس منشن أوتاكو ورع", 
    "🤢 ثالث منشن خايس", 
    "🦸‍♂️ ثاني منشن أنت عمه", 
    "🧠 ثالث منشن محنك", 
    "⚔️ ثالث منشن يشوف أتاك عمك", 
    "🏴‍☠️ ثاني منشن يشوف ون بيس عمك", 
    "💕 ثالث منشن يحبك", 
    "🫥 رابع منشن غدار", 
    "👶 خامس منشن ورع", 
    "🔝 خامس منشن متفوق", 
    "🚀 ثاني منشن بيرتقي قبلك", 
    "🎮 ثاني منشن نوب", 
    "😍 أول منشن بيكراش عليك", 
    "😡 أول منشن زهقان منك", 
    "📚 ثالث منشن نرد", 
    "💨 سادس منشن سحبة", 
    "🏃‍♂️ أول منشن هيهرب منكم", 
    "🐴 ثالث منشن حمار", 
    "🤝 ثالث منشن يثق فيك", 
    "😑 ثاني منشن زهق منك", 
    "🍜 رابع منشن فان ناروتو", 
    "🫠 خامس منشن غبي", 
    "🐑 رابع منشن خروف", 
    "💀 ثاني منشن بيكرهك", 
    "❤️ أول منشن يحبك", 
    "🎌 ثالث منشن أوتاكو", 
    "🙉 هش بقا صدعتني", 
    "🧠 ثالث منشن ذكي", 
    "👑 ثاني منشن فخم", 
    "💎 أول منشن فخم", 
    "🧐 خامس منشن أذكى منك", 
    "🤡 رابع منشن أغبى منك", 
    "⚡ أول منشن بيفداك 😉", 
    "💢 أول منشن يكرهك", 
    "🔍 ثالث منشن يراقبك", 
    "🏆 تاسع منشن يشوفك بطل", 
    "👶 رابع منشن يشوفك ورع"
]