let handler = async (m, { conn }) => {

  let lettersGame = [

    // أسماء

    "اسم ولد بحرف ⤌ أ", 

    "اسم بنت بحرف ⤌ ب", 

    "اسم نبات بحرف ⤌ ت", 

    "اسم حيوان بحرف ⤌ ث", 

    "اسم جماد بحرف ⤌ ج", 

    

    // دول ومدن

    "دولة عربية بحرف ⤌ ح", 

    "مدينة سعودية بحرف ⤌ خ", 

    "عاصمة أوروبية بحرف ⤌ د", 

    "مدينة بحرية بحرف ⤌ ذ", 

    

    // فواكه وخضروات

    "فاكهة بحرف ⤌ ر", 

    "خضار بحرف ⤌ ز", 

    "نبات بحرف ⤌ س", 

    "فاكهة استوائية بحرف ⤌ ش", 

    

    // حيوانات

    "حيوان بحرف ⤌ ص", 

    "طائر بحرف ⤌ ض", 

    "حيوان مفترس بحرف ⤌ ط", 

    "حيوان أليف بحرف ⤌ ظ", 

    

    // جمادات

    "جماد بحرف ⤌ ع", 

    "أداة كهربائية بحرف ⤌ غ", 

    "سيارة بحرف ⤌ ف", 

    "جهاز إلكتروني بحرف ⤌ ق", 

    

    // أخرى

    "مشروب بحرف ⤌ ك", 

    "لعبة بحرف ⤌ ل", 

    "مدرسة بحرف ⤌ م", 

    "مشهور بحرف ⤌ ن"

  ];

  let randomQuestion = lettersGame[Math.floor(Math.random() * lettersGame.length)];

  conn.reply(m.chat, `

🎮 *لعبة الحروف* 🎮

━━━━━━━━━━━━━

${randomQuestion}

━━━━━━━━━━━━━

❰ بواسطة مايكي ❱

`, m);

};

handler.help = ['حروف'];

handler.tags = ['games'];

handler.command = /^(حروف|احرف|الحروف)$/i;

export default handler;