import fs from 'fs';

let handler = async (m, { conn, usedPrefix, command }) => {
    if (command === 'م12') {
        let taguser = m.sender.split('@')[0];

        let menu = `❰･ اوامر الصوتيات ･❱
 ⚇━━━❰･𓃦･❱━━━⚇
*\`『 منور يا 』: \`*${taguser}
*\`『قبل كتابة اي امر حط نقطه』\`*
*\`『 التريخ 』: \`* ${date}
*\`『 المطور 』: \`* ♯𝚃𝙴𝚁𝙱𝚘
⚇━━━❰･𓃦･❱━━━⚇
❐┇🎧❯ ⸢ عميق ⸥ 
> لتعديل الصوت ليصبح عميقاً  
❐┇🎧❯ ⸢ منفوخ ⸥ 
> لتعديل الصوت ليصبح منفوخاً  
❐┇🎧❯ ⸢ تخين ⸥ 
> لتعديل الصوت ليصبح ثقيلاً  
❐┇🎧❯ ⸢ صاخب ⸥ 
> لتعديل الصوت ليصبح صاخباً  
❐┇🎧❯ ⸢ سريع ⸥ 
> لتسريع الصوت  
❐┇🎧❯ ⸢ تخينن ⸥ 
> لتكثيف الصوت أكثر  
❐┇🎧❯ ⸢ رفيع ⸥ 
> لتعديل الصوت ليصبح رفيعاً  
❐┇🎧❯ ⸢ تقطيع ⸥ 
> لإضافة تأثير التقطيع للصوت  
❐┇🎧❯ ⸢ روبوت ⸥ 
> لتعديل الصوت ليصبح آلياً  
❐┇🎧❯ ⸢ بطئ ⸥ 
> لإبطاء الصوت  
❐┇🎧❯ ⸢ ناعم ⸥ 
> لتعديل الصوت ليصبح ناعماً  
❐┇🎧❯ ⸢ سنجاب ⸥ 
> لتعديل الصوت ليصبح كصوت سنجاب  
┗━━━━━━━❰･𓃦･❱━━━━━━━┛
`;

        let imagePath = './م12.jpg';
        conn.sendMessage(m.chat, { 
            image: fs.readFileSync(imagePath), 
            caption: menu, 
            mentions: [m.sender] 
        });
    }
};

handler.help = ['م12'];
handler.tags = ['audio'];
handler.command = ['م12'];
handler.fail = null;

export default handler;