import fs from 'fs';

let handler = async (m, { conn, usedPrefix, command }) => {

    if (command === 'م2') {

        let taguser = m.sender.split('@')[0];

        let menu = `❰･ اوامر الفعليات ･❱
 ⚇━━━❰･𓃦･❱━━━⚇
*\`『 منور يا 』: \`*${taguser}
*\`『قبل كتابة اي امر حط نقطه』\`*
*\`『 التريخ 』: \`* ${date}
*\`『 المطور 』: \`* ♯𝚃𝙴𝚁𝙱𝚘
⚇━━━❰･𓃦･❱━━━⚇
❐┇🎮❯ ⸢ احزر ⸥
> لعبة "احزر الشخصية" من خلال صورة أو وصف  
❐┇🎮❯ ⸢ عين ⸥
> اختبار ذاكرة: يتم عرض صورة ويُطلب منك تذكر التفاصيل  
❐┇🎮❯ ⸢ علم ⸥
> لعبة "احزر علم الدولة"  
❐┇🎮❯ ⸢ احزر ⸥  
> لعبة كتابة بسرعة: اكتب الكلمة قبل الجميع  
❐┇🎮❯ ⸢ فكك ⸥  
> لعبة تفكيك الكلمات أو الجمل المشفرة  
❐┇🎮❯ ⸢ رتب ⸥  
> رتب الحروف لتشكيل الكلمة الصحيحة  
❐┇🎮❯ ⸢ خمن ⸥  
> خمن الرقم أو الشيء المطلوب في عدد محاولات محددة  
❐┇🎮❯ ⸢ مقوله ⸥  
> لعبة معرفة صاحب المقولة الشهيرة  
❐┇🎮❯ ⸢ سؤال ⸥  
> سؤال ثقافي أو ترفيهي سريع  
┗━━━━━━━❰･𓃦･❱━━━━━━━┛`;

        let imagePath = './م2.jpg'; // تأكد من وجود صورة لهذا القسم إن أحببت

        conn.sendMessage(m.chat, {
            image: fs.readFileSync(imagePath),
            caption: menu,
            mentions: [m.sender]
        });
    }
};

handler.help = ['م2'];
handler.tags = ['game'];
handler.command = ['م2'];
handler.fail = null;

export default handler;