import fs from 'fs';

let handler = async (m, { conn, usedPrefix, command }) => {

    if (command === 'م4') {

        let taguser = m.sender.split('@')[0];

        let menu = `❰･ اوامر الترفيه ･❱
 ⚇━━━❰･𓃦･❱━━━⚇
*\`『 منور يا 』\` : *${taguser}
*\`『قبل كتابة اي امر حط نقطه』\`*
*\`『 التريخ 』\`* : ${date}
*\`『 المطور 』\`* ♯𝚃𝙴𝚁𝙱𝚘
⚇━━━❰･𓃦･❱━━━⚇
❐┇🎲❯ ⸢ اكس ⸥  
> لعبة XO مع البوت أو شخص  
❐┇🎲❯ ⸢ هل ⸥  
> هل أنت/هل تحب؟ أسئلة عشوائية طريفة  
❐┇🎲❯ ⸢ جاي ⸥  
> تحدي "مين جاي؟" للشخصيات أو الأعضاء  
❐┇🎲❯ ⸢ العب ⸥  
> أوامر ترفيهية متنوعة (مزح وضحك)  
❐┇🎲❯ ⸢ صديق ⸥  
> من هو صديقك الحقيقي؟  
❐┇🎲❯ ⸢ غباء ⸥  
> كم نسبة الغباء عندك؟ (مزحة)  
❐┇🎲❯ ⸢ شخصيه ⸥  
> اختبار شخصيتك بطريقة عشوائية  
❐┇🎲❯ ⸢ لو ⸥  
> لعبة "لو كنت..." أو "لو صار..."  
❐┇🎲❯ ⸢ ذكاء ⸥  
> نسبة الذكاء العشوائية (للتسلية)  
❐┇🎲❯ ⸢ حكمه ⸥  
> يعرض لك حكمة عشوائية جميلة  
❐┇🎲❯ ⸢ الحب ⸥  
> كم نسبة حبك أو حب شخص لك؟  
❐┇🎲❯ ⸢ ميمز ⸥  
> صور ميمز مضحكة  
❐┇🎲❯ ⸢ غزل ⸥  
> رسائل غزل عشوائية  
❐┇🎲❯ ⸢ صراحه ⸥  
> أسئلة لعبة الصراحة  
❐┇🎲❯ ⸢ تعريفي ⸥  
> يعرض بطاقة تعريف عشوائية أو طريفة  
┗━━━━━━━❰･𓃦･❱━━━━━━━┛`;

        let imagePath = './media/menus/img1.jpg'; // تأكد من وجود صورة مناسبة

        conn.sendMessage(m.chat, {
            image: fs.readFileSync(imagePath),
            caption: menu,
            mentions: [m.sender]
        });
    }
};

handler.help = ['م4'];
handler.tags = ['fun'];
handler.command = ['م4'];
handler.fail = null;

export default handler;