import fs from 'fs';

let handler = async (m, { conn, usedPrefix, command }) => {

    if (command === 'م6') {
        let taguser = m.sender.split('@')[0];

        let menu = `❰･ اوامر البنك ･❱
 ⚇━━━❰･𓃦･❱━━━⚇
*\`『 منور يا 』: \`*${taguser}
*\`『قبل كتابة اي امر حط نقطه』\`*
*\`『 التريخ 』: \`* ${date}
*\`『 المطور 』: \`* ♯𝚃𝙴𝚁𝙱𝚘
⚇━━━❰･𓃦･❱━━━⚇
❐┇🏦❯ ⸢ بنك ⸥  
> لعرض رصيدك ووضعك في البنك  
❐┇🏦❯ ⸢ محفظتي ⸥  
> لمعرفة رصيدك الحالي  
❐┇🏦❯ ⸢ تحويل ⸥  
> لتحويل الأموال للآخرين  
❐┇🏦❯ ⸢ ايداع ⸥  
> لإيداع الأموال في حسابك البنكي  
❐┇🏦❯ ⸢ سحب ⸥  
> لسحب الأموال من حسابك البنكي  
❐┇🏦❯ ⸢ عمل ⸥  
> للعمل وكسب المال  
❐┇🏦❯ ⸢ رحلة ⸥  
> للذهاب في رحلة وكسب المكافآت      
❐┇🏦❯ ⸢ هجوم ⸥  
> لشن هجوم وكسب الغنائم  
❐┇🏦❯ ⸢ يومي ⸥  
> لاستلام مكافأتك اليومية  
❐┇🏦❯ ⸢ اسبوعي ⸥  
> لاستلام مكافأتك الأسبوعية  
❐┇🏦❯ ⸢ يومي ⸥  
> لاستلام مكافأتك الشهرية  
❐┇🏦❯ ⸢ جائزة ⸥  
> لاستلام جوائزك (بالرد على رسالة الفوز)  
┗━━━━━━━❰･𓃦･❱━━━━━━━┛ 
`;

        let imagePath = './م6.jpg'; // تأكد أن الصورة موجودة في نفس مجلد السكربت

        conn.sendMessage(m.chat, {   
            image: fs.readFileSync(imagePath),   
            caption: menu,   
            mentions: [m.sender]   
        });  
    }
};

handler.help = ['م6'];
handler.tags = ['bank'];
handler.command = ['م6'];
handler.fail = null;

export default handler;