import fs from 'fs';

let handler = async (m, { conn, usedPrefix, command }) => {

    if (command === 'م8') {
        let taguser = m.sender.split('@')[0];

        let menu = `❰･ اوامر الادوات ･❱
 ⚇━━━❰･𓃦･❱━━━⚇
*\`『 منور يا 』: \`*${taguser}
*\`『قبل كتابة اي امر حط نقطه』\`*
*\`『 التريخ 』: \`* ${date}
*\`『 المطور 』: \`* ♯𝚃𝙴𝚁𝙱𝚘
⚇━━━❰･𓃦･❱━━━⚇
❐┇⚙️❯ ⸢ انطق ⸥   
> لتحويل النص إلى صوت مسموع     
❐┇⚙️❯ ⸢ ملصق ⸥   
> لتحويل الصورة إلى ملصق  
❐┇⚙️❯ ⸢ حقوق ⸥   
> لعرض حقوق المجموعة  
❐┇⚙️❯ ⸢ تصميم ⸥   
> لأدوات التصميم المختلفة  
❐┇⚙️❯ ⸢ بنج ⸥   
> لفحص سرعة الاتصال  
❐┇⚙️❯ ⸢ اختفاء ⸥   
> لإخفاء الرسائل لمدة معينة  
❐┇⚙️❯ ⸢ اشباح ⸥   
> لعرض قائمة الأعضاء غير النشطين  
❐┇⚙️❯ ⸢ قوانين ⸥   
> لعرض قوانين المجموعة  
❐┇⚙️❯ ⸢ ميسي ⸥   
> لمعلومات عن ليونيل ميسي  
❐┇⚙️❯ ⸢ كريستيانو ⸥   
> لمعلومات عن كريستيانو رونالدو  
❐┇⚙️❯ ⸢ تصليح ⸥   
> لإصلاح مشاكل المجموعة  
❐┇⚙️❯ ⸢ قطه ⸥   
> لصور عشوائية للقطط  
❐┇⚙️❯ ⸢ طقم ⸥   
> لإنشاء أطقم صور  
❐┇⚙️❯ ⸢ جروبي ⸥   
> لمعلومات المجموعة  
❐┇⚙️❯ ⸢ رمزي ⸥   
> لإنشاء رموز خاصة  
❐┇⚙️❯ ⸢ جوده ⸥   
> لتحسين جودة الصور  
┗━━━━━━━❰･𓃦･❱━━━━━━━┛
`;

        let imagePath = './م8.jpg';

        conn.sendMessage(m.chat, { 
            image: fs.readFileSync(imagePath), 
            caption: menu, 
            mentions: [m.sender] 
        });
    }
};

handler.help = ['م8'];
handler.tags = ['tools'];
handler.command = ['م8'];
handler.fail = null;

export default handler;